In [1]:
import pandas as pd
import numpy as np

# Data Cleaning

## Date Dimension

In [2]:
df = pd.read_excel(r"D:\Zephyr Data\project\OG Data\DimDate.xlsx")
df

,DateKey,Date,DayNumberOfWeek,DayNameOfWeek,DayNumberOfMonth,DayNumberOfYear,WeekNumberOfYear,MonthName,MonthNumberOfYear,CalendarQuarter,CalendarYear,CalendarSemester,FiscalQuarter,FiscalYear,FiscalSemester
0,20050101,2005-01-01,7,Saturday,1,1,1,January,1,1,2005,1,3,2005,2
1,20050102,2005-01-02,1,Sunday,2,2,2,January,1,1,2005,1,3,2005,2
2,20050103,2005-01-03,2,Monday,3,3,2,January,1,1,2005,1,3,2005,2
3,20050104,2005-01-04,3,Tuesday,4,4,2,January,1,1,2005,1,3,2005,2
4,20050105,2005-01-05,4,Wednesday,5,5,2,January,1,1,2005,1,3,2005,2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3647,20141227,2014-12-27,7,Saturday,27,361,52,December,12,4,2014,2,2,2014,1
3648,20141228,2014-12-28,1,Sunday,28,362,53,December,12,4,2014,2,2,2014,1
3649,20141229,2014-12-29,2,Monday,29,363,53,December,12,4,2014,2,2,2014,1
3650,20141230,2014-12-30,3,Tuesday,30,364,53,December,12,4,2014,2,2,2014,1
3651,20141231,2014-12-31,4,Wednesday,31,365,53,December,12,4,2014,2,2,2014,1

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3652 entries, 0 to 3651
Data columns (total 15 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   DateKey            3652 non-null   int64
 1   Date               3652 non-null   datetime64[ns]
 2   DayNumberOfWeek    3652 non-null   int64
 3   DayNameOfWeek      3652 non-null   object
 4   DayNumberOfMonth   3652 non-null   int64
 5   DayNumberOfYear    3652 non-null   int64
 6   WeekNumberOfYear   3652 non-null   int64
 7   MonthName          3652 non-null   object
 8   MonthNumberOfYear  3652 non-null   int64
 9   CalendarQuarter    3652 non-null   int64
 10  CalendarYear       3652 non-null   int64
 11  CalendarSemester   3652 non-null   int64
 12  FiscalQuarter      3652 non-null   int64
 13  FiscalYear         3652 non-null   int64
 14  FiscalSemester     3652 non-null   int64
dtypes: datetime64[ns](1), int64(12), object(2)
memory usage: 428.1+ KB

In [4]:
df.columns = df.columns.str.strip()

In [5]:
df["DateKey"].duplicated().sum()

np.int64(0)

In [6]:
df.isna().sum()

DateKey              0
Date                 0
DayNumberOfWeek      0
DayNameOfWeek        0
DayNumberOfMonth     0
DayNumberOfYear      0
WeekNumberOfYear     0
MonthName            0
MonthNumberOfYear    0
CalendarQuarter      0
CalendarYear         0
CalendarSemester     0
FiscalQuarter        0
FiscalYear           0
FiscalSemester       0
dtype: int64

In [7]:
df.to_csv(r"D:\Zephyr Data\project\Cleaned Data\Dim_Date.csv", index= False)

## Store Location Geography

In [2]:
df = pd.read_excel(r"D:\Zephyr Data\project\OG Data\DimGeography.xlsx")
df

,GeographyKey,City,StateProvinceCode,StateProvinceName,CountryRegionCode,EnglishCountryRegionName,PostalCode,SalesTerritoryKey
0,1,Alexandria,NSW,New South Wales,AU,Australia,2015,9
1,2,Coffs Harbour,NSW,New South Wales,AU,Australia,2450,9
2,3,Darlinghurst,NSW,New South Wales,AU,Australia,2010,9
3,4,Goulburn,NSW,New South Wales,AU,Australia,2580,9
4,5,Lane Cove,NSW,New South Wales,AU,Australia,1597,9
...,...,...,...,...,...,...,...,...
650,651,Mosinee,WI,Wisconsin,US,United States,54455,3
651,652,Racine,WI,Wisconsin,US,United States,53182,3
652,653,Casper,WY,Wyoming,US,United States,82601,1
653,654,Cheyenne,WY,Wyoming,US,United States,82001,1
654,655,Rock Springs,WY,Wyoming,US,United States,82901,1

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 655 entries, 0 to 654
Data columns (total 8 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   GeographyKey              655 non-null    int64
 1   City                      655 non-null    object
 2   StateProvinceCode         655 non-null    object
 3   StateProvinceName         655 non-null    object
 4   CountryRegionCode         655 non-null    object
 5   EnglishCountryRegionName  655 non-null    object
 6   PostalCode                655 non-null    object
 7   SalesTerritoryKey         655 non-null    int64
dtypes: int64(2), object(6)
memory usage: 41.1+ KB

In [4]:
df.duplicated().sum()

np.int64(0)

In [5]:
df.isna().sum()

GeographyKey                0
City                        0
StateProvinceCode           0
StateProvinceName           0
CountryRegionCode           0
EnglishCountryRegionName    0
PostalCode                  0
SalesTerritoryKey           0
dtype: int64

In [6]:
df.columns = df.columns.str.strip()

In [7]:
df = df.rename(columns={
    "StateProvinceCode": "StateCode",
    "StateProvinceName": "StateName",
    "EnglishCountryRegionName": "CountryName",
    "CountryRegionCode" : "CountryCode"
})

In [8]:
df

,GeographyKey,City,StateCode,StateName,CountryCode,CountryName,PostalCode,SalesTerritoryKey
0,1,Alexandria,NSW,New South Wales,AU,Australia,2015,9
1,2,Coffs Harbour,NSW,New South Wales,AU,Australia,2450,9
2,3,Darlinghurst,NSW,New South Wales,AU,Australia,2010,9
3,4,Goulburn,NSW,New South Wales,AU,Australia,2580,9
4,5,Lane Cove,NSW,New South Wales,AU,Australia,1597,9
...,...,...,...,...,...,...,...,...
650,651,Mosinee,WI,Wisconsin,US,United States,54455,3
651,652,Racine,WI,Wisconsin,US,United States,53182,3
652,653,Casper,WY,Wyoming,US,United States,82601,1
653,654,Cheyenne,WY,Wyoming,US,United States,82001,1
654,655,Rock Springs,WY,Wyoming,US,United States,82901,1

In [14]:
df.to_csv(r"D:\Zephyr Data\project\Cleaned Data\Dim_Geography.csv", index= False)

## Product Information

In [15]:
df = pd.read_excel(r"D:\Zephyr Data\project\OG Data\DimProduct.xlsx")
df

,ProductKey,ProductName,Color,SafetyStockLevel,ReorderPoint,ListPrice,Size,Weight,DaysToManufacture,ProductSubcategoryKey
0,1,Adjustable Race,NaN,1000,750,NaN,NaN,NaN,0,NaN
1,2,Bearing Ball,NaN,1000,750,NaN,NaN,NaN,0,NaN
2,3,BB Ball Bearing,NaN,800,600,NaN,NaN,NaN,1,NaN
3,4,Headset Ball Bearings,NaN,800,600,NaN,NaN,NaN,0,NaN
4,5,Blade,NaN,800,600,NaN,NaN,NaN,1,NaN
...,...,...,...,...,...,...,...,...,...,...
601,602,ML Bottom Bracket,NaN,500,375,101.24,NaN,168.00,1,5.0
602,603,HL Bottom Bracket,NaN,500,375,121.49,NaN,170.00,1,5.0
603,604,"Road-750 Black, 44",Black,100,75,539.99,44,19.77,4,2.0
604,605,"Road-750 Black, 48",Black,100,75,539.99,48,20.13,4,2.0
605,606,"Road-750 Black, 52",Black,100,75,539.99,52,20.42,4,2.0

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 606 entries, 0 to 605
Data columns (total 10 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   ProductKey             606 non-null    int64
 1   ProductName            606 non-null    object
 2   Color                  352 non-null    object
 3   SafetyStockLevel       606 non-null    int64
 4   ReorderPoint           606 non-null    int64
 5   ListPrice              395 non-null    float64
 6   Size                   299 non-null    object
 7   Weight                 282 non-null    float64
 8   DaysToManufacture      606 non-null    int64
 9   ProductSubcategoryKey  397 non-null    float64
dtypes: float64(3), int64(4), object(3)
memory usage: 47.5+ KB

In [17]:
df.duplicated().sum()

np.int64(0)

In [18]:
df.columns = df.columns.str.strip()

In [19]:
df["ProductSubcategoryKey"].isna().sum() # Product Subcategory with null not required

np.int64(209)

In [20]:
df.dropna(subset= "ProductSubcategoryKey", inplace=True)

In [21]:
df = df.drop(["Size","Weight","SafetyStockLevel","ReorderPoint","DaysToManufacture","Color"], axis=1) # Columns not required

In [22]:
df.isna().sum() # color NA value is due to color not available(not required)

ProductKey               0
ProductName              0
ListPrice                2
ProductSubcategoryKey    0
dtype: int64

In [23]:
df.dropna(subset= "ListPrice", inplace=True) # Not required

In [24]:
df["ProductSubcategoryKey"]= df["ProductSubcategoryKey"].astype("int") # changed from float to int

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 395 entries, 211 to 605
Data columns (total 4 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   ProductKey             395 non-null    int64
 1   ProductName            395 non-null    object
 2   ListPrice              395 non-null    float64
 3   ProductSubcategoryKey  395 non-null    int64
dtypes: float64(1), int64(2), object(1)
memory usage: 15.4+ KB

In [26]:
df.isna().sum()

ProductKey               0
ProductName              0
ListPrice                0
ProductSubcategoryKey    0
dtype: int64

In [27]:
df

     ProductKey              ProductName  ListPrice  ProductSubcategoryKey
211         212    Sport-100 Helmet, Red    33.6442                     31
212         213    Sport-100 Helmet, Red    33.6442                     31
213         214    Sport-100 Helmet, Red    34.9900                     31
214         215  Sport-100 Helmet, Black    33.6442                     31
215         216  Sport-100 Helmet, Black    33.6442                     31
..          ...                      ...        ...                    ...
601         602        ML Bottom Bracket   101.2400                      5
602         603        HL Bottom Bracket   121.4900                      5
603         604       Road-750 Black, 44   539.9900                      2
604         605       Road-750 Black, 48   539.9900                      2
605         606       Road-750 Black, 52   539.9900                      2

[395 rows x 4 columns]

In [28]:
df.to_csv(r"D:\Zephyr Data\project\Cleaned Data\Dim_Product.csv", index= False)

## Product Category

In [29]:
df = pd.read_excel(r"D:\Zephyr Data\project\OG Data\DimProductCategory.xlsx")
df

   ProductCategoryKey  ProductCategoryAlternateKey ProductCategoryName
0                   1                            1               Bikes
1                   2                            2          Components
2                   3                            3            Clothing
3                   4                            4         Accessories

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   ProductCategoryKey           4 non-null      int64
 1   ProductCategoryAlternateKey  4 non-null      int64
 2   ProductCategoryName          4 non-null      object
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [31]:
df.columns = df.columns.str.strip()

In [32]:
df = df.drop("ProductCategoryAlternateKey", axis=1)

In [33]:
df

   ProductCategoryKey ProductCategoryName
0                   1               Bikes
1                   2          Components
2                   3            Clothing
3                   4         Accessories

In [34]:
df.to_csv(r"D:\Zephyr Data\project\Cleaned Data\Dim_ProductCategory.csv", index= False)

## Product SubCategory

In [35]:
df = pd.read_excel(r"D:\Zephyr Data\project\OG Data\DimProductSubcategory.xlsx")
df

,ProductSubcategoryKey,ProductSubcategoryAlternateKey,ProductSubcategoryName,ProductCategoryKey
0,1,1,Mountain Bikes,1
1,2,2,Road Bikes,1
2,3,3,Touring Bikes,1
3,4,4,Handlebars,2
4,5,5,Bottom Brackets,2
5,6,6,Brakes,2
6,7,7,Chains,2
7,8,8,Cranksets,2
8,9,9,Derailleurs,2
9,10,10,Forks,2
10,11,11,Headsets,2
11,12,12,Mountain Frames,2
12,13,13,Pedals,2
13,14,14,Road Frames,2
14,15,15,Saddles,2
15,16,16,Touring Frames,2
16,17,17,Wheels,2
17,18,18,Bib-Shorts,3
18,19,19,Caps,3
19,20,20,Gloves,3
20,21,21,Jerseys,3
21,22,22,Shorts,3
22,23,23,Socks,3
23,24,24,Tights,3
24,25,25,Vests,3
25,26,26,Bike Racks,4
26,27,27,Bike Stands,4
27,28,28,Bottles and Cages,4
28,29,29,Cleaners,4
29,30,30,Fenders,4
30,31,31,Helmets,4
31,32,32,Hydration Packs,4
32,33,33,Lights,4
33,34,34,Locks,4
34,35,35,Panniers,4
35,36,36,Pumps,4
36,37,37,Tires and Tubes,4

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37 entries, 0 to 36
Data columns (total 4 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   ProductSubcategoryKey           37 non-null     int64
 1   ProductSubcategoryAlternateKey  37 non-null     int64
 2   ProductSubcategoryName          37 non-null     object
 3   ProductCategoryKey              37 non-null     int64
dtypes: int64(3), object(1)
memory usage: 1.3+ KB

In [37]:
df.isna().sum()

ProductSubcategoryKey             0
ProductSubcategoryAlternateKey    0
ProductSubcategoryName            0
ProductCategoryKey                0
dtype: int64

In [38]:
df.columns = df.columns.str.strip()

In [39]:
df = df.drop("ProductSubcategoryAlternateKey",axis=1)

In [40]:
df

    ProductSubcategoryKey ProductSubcategoryName  ProductCategoryKey
0                       1         Mountain Bikes                   1
1                       2             Road Bikes                   1
2                       3          Touring Bikes                   1
3                       4             Handlebars                   2
4                       5        Bottom Brackets                   2
5                       6                 Brakes                   2
6                       7                 Chains                   2
7                       8              Cranksets                   2
8                       9            Derailleurs                   2
9                      10                  Forks                   2
10                     11               Headsets                   2
11                     12        Mountain Frames                   2
12                     13                 Pedals                   2
13                     14            Road Frames                   2
14                     15                Saddles                   2
15                     16         Touring Frames                   2
16                     17                 Wheels                   2
17                     18             Bib-Shorts                   3
18                     19                   Caps                   3
19                     20                 Gloves                   3
20                     21                Jerseys                   3
21                     22                 Shorts                   3
22                     23                  Socks                   3
23                     24                 Tights                   3
24                     25                  Vests                   3
25                     26             Bike Racks                   4
26                     27            Bike Stands                   4
27                     28      Bottles and Cages                   4
28                     29               Cleaners                   4
29                     30                Fenders                   4
30                     31                Helmets                   4
31                     32        Hydration Packs                   4
32                     33                 Lights                   4
33                     34                  Locks                   4
34                     35               Panniers                   4
35                     36                  Pumps                   4
36                     37        Tires and Tubes                   4

In [41]:
df.to_csv(r"D:\Zephyr Data\project\Cleaned Data\Dim_ProductSubcategory.csv", index= False)

## Sales Data

In [42]:
df = pd.read_excel(r"D:\Zephyr Data\project\OG Data\FactInternetSales.xlsx")
df

,ProductKey,OrderDateKey,DueDateKey,ShipDateKey,CustomerKey,PromotionKey,CurrencyKey,SalesTerritoryKey,SalesOrderNumber,SalesOrderLineNumber,...,ProductStandardCost,TotalProductCost,SalesAmount,TaxAmt,Freight,CarrierTrackingNumber,CustomerPONumber,OrderDate,DueDate,ShipDate
0,310,20101229,20110110,20110105,21768,1,19,6,SO43697,1,...,2171.2942,2171.2942,3578.2700,286.2616,89.4568,NaN,NaN,2010-12-29,2011-01-10,2011-01-05
1,310,20101229,20110110,20110105,21768,1,19,6,SO43697,1,...,2171.2942,2171.2942,3578.2700,286.2616,89.4568,NaN,NaN,2010-12-29,2011-01-10,2011-01-05
2,346,20101229,20110110,20110105,28389,1,39,7,SO43698,1,...,1912.1544,1912.1544,3399.9900,271.9992,84.9998,NaN,NaN,2010-12-29,2011-01-10,2011-01-05
3,346,20101229,20110110,20110105,25863,1,100,1,SO43699,1,...,1912.1544,1912.1544,3399.9900,271.9992,84.9998,NaN,NaN,2010-12-29,2011-01-10,2011-01-05
4,336,20101229,20110110,20110105,14501,1,100,4,SO43700,1,...,413.1463,413.1463,699.0982,55.9279,17.4775,NaN,NaN,2010-12-29,2011-01-10,2011-01-05
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
60394,485,20140128,20140209,20140204,15868,1,100,6,SO75122,1,...,8.2205,8.2205,21.9800,1.7584,0.5495,NaN,NaN,2014-01-28,2014-02-09,2014-02-04
60395,225,20140128,20140209,20140204,15868,1,100,6,SO75122,2,...,6.9223,6.9223,8.9900,0.7192,0.2248,NaN,NaN,2014-01-28,2014-02-09,2014-02-04
60396,485,20140128,20140209,20140204,18759,1,100,6,SO75123,1,...,8.2205,8.2205,21.9800,1.7584,0.5495,NaN,NaN,2014-01-28,2014-02-09,2014-02-04
60397,486,20140128,20140209,20140204,18759,1,100,6,SO75123,2,...,59.4660,59.4660,159.0000,12.7200,3.9750,NaN,NaN,2014-01-28,2014-02-09,2014-02-04
60398,225,20140128,20140209,20140204,18759,1,100,6,SO75123,3,...,6.9223,6.9223,8.9900,0.7192,0.2248,NaN,NaN,2014-01-28,2014-02-09,2014-02-04

In [43]:
pd.set_option('display.max_columns', None)

In [44]:
df.describe()

,ProductKey,OrderDateKey,DueDateKey,ShipDateKey,CustomerKey,PromotionKey,CurrencyKey,SalesTerritoryKey,SalesOrderLineNumber,RevisionNumber,OrderQuantity,UnitPrice,ExtendedAmount,UnitPriceDiscountPct,DiscountAmount,ProductStandardCost,TotalProductCost,SalesAmount,TaxAmt,Freight,CarrierTrackingNumber,CustomerPONumber,OrderDate,DueDate,ShipDate
count,60399.000000,6.039900e+04,6.039900e+04,6.039900e+04,60399.000000,60399.000000,60399.000000,60399.000000,60399.000000,60399.0,60399.0,60399.000000,60399.000000,60399.0,60399.0,60399.000000,60399.000000,60399.000000,60399.000000,60399.000000,0.0,0.0,59341,59341,59341
mean,437.555820,2.012973e+07,2.013010e+07,2.012994e+07,18841.733870,1.041838,69.844484,6.244458,1.886306,1.0,1.0,286.096870,486.138106,0.0,0.0,286.096870,286.096870,486.138106,38.891049,12.153497,NaN,NaN,2013-06-09 11:15:49.367216640,2013-06-21 11:15:49.367216640,2013-06-16 11:15:49.367216384
min,214.000000,2.010123e+07,2.011011e+07,2.011010e+07,11000.000000,1.000000,6.000000,1.000000,1.000000,1.0,1.0,0.856500,2.290000,0.0,0.0,0.856500,0.856500,2.290000,0.183200,0.057300,NaN,NaN,2010-12-29 00:00:00,2011-01-10 00:00:00,2011-01-05 00:00:00
25%,359.000000,2.013040e+07,2.013042e+07,2.013041e+07,14003.000000,1.000000,19.000000,4.000000,1.000000,1.0,1.0,2.973300,7.950000,0.0,0.0,2.973300,2.973300,7.950000,0.636000,0.198800,NaN,NaN,2013-04-03 00:00:00,2013-04-15 00:00:00,2013-04-10 00:00:00
50%,479.000000,2.013071e+07,2.013073e+07,2.013072e+07,18143.000000,1.000000,100.000000,7.000000,2.000000,1.0,1.0,11.216300,29.990000,0.0,0.0,11.216300,11.216300,29.990000,2.399200,0.749800,NaN,NaN,2013-07-14 00:00:00,2013-07-26 00:00:00,2013-07-21 00:00:00
75%,529.000000,2.013102e+07,2.013103e+07,2.013102e+07,23429.500000,1.000000,100.000000,9.000000,2.000000,1.0,1.0,294.579700,539.990000,0.0,0.0,294.579700,294.579700,539.990000,43.199200,13.499800,NaN,NaN,2013-10-18 00:00:00,2013-10-30 00:00:00,2013-10-25 00:00:00
max,606.000000,2.014013e+07,2.014021e+07,2.014020e+07,29483.000000,14.000000,100.000000,10.000000,8.000000,1.0,1.0,2171.294200,3578.270000,0.0,0.0,2171.294200,2171.294200,3578.270000,286.261600,89.456800,NaN,NaN,2014-01-28 00:00:00,2014-02-09 00:00:00,2014-02-04 00:00:00
std,118.088554,4.746429e+03,4.986076e+03,4.851692e+03,5432.398481,0.342602,42.146522,2.961125,1.016326,0.0,0.0,552.506321,928.567452,0.0,0.0,552.506321,552.506321,928.567452,74.285397,23.214187,NaN,NaN,NaN,NaN,NaN

In [45]:
df.columns = df.columns.str.strip()

In [46]:
df[['DiscountAmount','UnitPriceDiscountPct']].nunique()

DiscountAmount          1
UnitPriceDiscountPct    1
dtype: int64

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60399 entries, 0 to 60398
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   ProductKey             60399 non-null  int64
 1   OrderDateKey           60399 non-null  int64
 2   DueDateKey             60399 non-null  int64
 3   ShipDateKey            60399 non-null  int64
 4   CustomerKey            60399 non-null  int64
 5   PromotionKey           60399 non-null  int64
 6   CurrencyKey            60399 non-null  int64
 7   SalesTerritoryKey      60399 non-null  int64
 8   SalesOrderNumber       60399 non-null  object
 9   SalesOrderLineNumber   60399 non-null  int64
 10  RevisionNumber         60399 non-null  int64
 11  OrderQuantity          60399 non-null  int64
 12  UnitPrice              60399 non-null  float64
 13  ExtendedAmount         60399 non-null  float64
 14  UnitPriceDiscountPct   60399 non-null  int64
 15  DiscountAmount         60399 non-null  int64
 16  ProductStandardCost    60399 non-null  float64
 17  TotalProductCost       60399 non-null  float64
 18  SalesAmount            60399 non-null  float64
 19  TaxAmt                 60399 non-null  float64
 20  Freight                60399 non-null  float64
 21  CarrierTrackingNumber  0 non-null      float64
 22  CustomerPONumber       0 non-null      float64
 23  OrderDate              59341 non-null  datetime64[ns]
 24  DueDate                59341 non-null  datetime64[ns]
 25  ShipDate               59341 non-null  datetime64[ns]
dtypes: datetime64[ns](3), float64(9), int64(13), object(1)
memory usage: 12.0+ MB

In [48]:
# not required columns
df = df.drop(["SalesOrderLineNumber","RevisionNumber","PromotionKey","CarrierTrackingNumber","CustomerPONumber","OrderDate","DueDate","ShipDate","UnitPriceDiscountPct",'DiscountAmount',"ExtendedAmount","ProductStandardCost"], axis=1)

In [49]:
df.isna().sum()

ProductKey           0
OrderDateKey         0
DueDateKey           0
ShipDateKey          0
CustomerKey          0
CurrencyKey          0
SalesTerritoryKey    0
SalesOrderNumber     0
OrderQuantity        0
UnitPrice            0
TotalProductCost     0
SalesAmount          0
TaxAmt               0
Freight              0
dtype: int64

In [50]:
df.duplicated().sum()

np.int64(1)

In [51]:
df = df.drop_duplicates()

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 60398 entries, 0 to 60398
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   ProductKey         60398 non-null  int64
 1   OrderDateKey       60398 non-null  int64
 2   DueDateKey         60398 non-null  int64
 3   ShipDateKey        60398 non-null  int64
 4   CustomerKey        60398 non-null  int64
 5   CurrencyKey        60398 non-null  int64
 6   SalesTerritoryKey  60398 non-null  int64
 7   SalesOrderNumber   60398 non-null  object
 8   OrderQuantity      60398 non-null  int64
 9   UnitPrice          60398 non-null  float64
 10  TotalProductCost   60398 non-null  float64
 11  SalesAmount        60398 non-null  float64
 12  TaxAmt             60398 non-null  float64
 13  Freight            60398 non-null  float64
dtypes: float64(5), int64(8), object(1)
memory usage: 6.9+ MB

In [53]:
df["TotalSalesAmount"] = df["SalesAmount"]+df["TaxAmt"]+df["Freight"]

In [54]:
df["Profit"] = df["SalesAmount"] - df["TotalProductCost"]

In [55]:
df

,ProductKey,OrderDateKey,DueDateKey,ShipDateKey,CustomerKey,CurrencyKey,SalesTerritoryKey,SalesOrderNumber,OrderQuantity,UnitPrice,TotalProductCost,SalesAmount,TaxAmt,Freight,TotalSalesAmount,Profit
0,310,20101229,20110110,20110105,21768,19,6,SO43697,1,2171.2942,2171.2942,3578.2700,286.2616,89.4568,3953.9884,1406.9758
2,346,20101229,20110110,20110105,28389,39,7,SO43698,1,1912.1544,1912.1544,3399.9900,271.9992,84.9998,3756.9890,1487.8356
3,346,20101229,20110110,20110105,25863,100,1,SO43699,1,1912.1544,1912.1544,3399.9900,271.9992,84.9998,3756.9890,1487.8356
4,336,20101229,20110110,20110105,14501,100,4,SO43700,1,413.1463,413.1463,699.0982,55.9279,17.4775,772.5036,285.9519
5,346,20101229,20110110,20110105,11003,6,9,SO43701,1,1912.1544,1912.1544,3399.9900,271.9992,84.9998,3756.9890,1487.8356
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
60394,485,20140128,20140209,20140204,15868,100,6,SO75122,1,8.2205,8.2205,21.9800,1.7584,0.5495,24.2879,13.7595
60395,225,20140128,20140209,20140204,15868,100,6,SO75122,1,6.9223,6.9223,8.9900,0.7192,0.2248,9.9340,2.0677
60396,485,20140128,20140209,20140204,18759,100,6,SO75123,1,8.2205,8.2205,21.9800,1.7584,0.5495,24.2879,13.7595
60397,486,20140128,20140209,20140204,18759,100,6,SO75123,1,59.4660,59.4660,159.0000,12.7200,3.9750,175.6950,99.5340
60398,225,20140128,20140209,20140204,18759,100,6,SO75123,1,6.9223,6.9223,8.9900,0.7192,0.2248,9.9340,2.0677

In [56]:
df.to_csv(r"D:\Zephyr Data\project\Cleaned Data\Fact_InternetSales.csv", index= False)

## Customer Data

In [57]:
df = pd.read_csv(r"D:\Zephyr Data\project\OG Data\DimCustomer.csv",encoding="latin1")

In [58]:
df

,CustomerKey,GeographyKey,CustomerAlternateKey,Title,Name,NameStyle,BirthDate,MaritalStatus,Suffix,Gender,EmailAddress,YearlyIncome,TotalChildren,NumberChildrenAtHome,EnglishEducation,SpanishEducation,FrenchEducation,EnglishOccupation,SpanishOccupation,FrenchOccupation,HouseOwnerFlag,NumberCarsOwned,AddressLine1,AddressLine2,Phone,DateFirstPurchase,CommuteDistance
0,11000,26,AW00011000,NaN,Jon Yang,False,6/10/1971,M,NaN,M,jon24@adventure-works.com,USD 90000,one,2,Bachelors,Licenciatura,Bac + 4,Professional,Profesional,Cadre,1,0,3761 N. 14th St,NaN,1 (11) 500 555-0162,19/01/2011,1-2 Miles
1,11001,37,AW00011001,NaN,Eugene Huang,False,10/05/1976,S,NaN,M,eugene10@adventure-works.com,USD 60000,Three,3,Bachelors,Licenciatura,Bac + 4,Professional,Profesional,Cadre,0,1,2243 W St.,NaN,1 (11) 500 555-0110,15/01/2011,0-1 Miles
2,11002,31,AW00011002,NaN,Ruben Torres,False,9/02/1971,M,NaN,M,ruben35@adventure-works.com,USD 60000,Three,3,Bachelors,Licenciatura,Bac + 4,Professional,Profesional,Cadre,1,1,5844 Linden Land,NaN,1 (11) 500 555-0184,7/01/2011,2-5 Miles
3,11003,11,AW00011003,NaN,Christy Zhu,False,14/08/1973,S,NaN,F,christy12@adventure-works.com,USD 70000,NaN,0,Bachelors,Licenciatura,Bac + 4,Professional,Profesional,Cadre,0,1,1825 Village Pl.,NaN,1 (11) 500 555-0162,29/12/2010,5-10 Miles
4,11004,19,AW00011004,NaN,Elizabeth Johnson,False,5/08/1979,S,NaN,F,elizabeth5@adventure-works.com,USD 80000,Five,5,Bachelors,Licenciatura,Bac + 4,Professional,Profesional,Cadre,1,4,7553 Harness Circle,NaN,1 (11) 500 555-0131,23/01/2011,1-2 Miles
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18479,29479,209,AW00029479,NaN,Tommy Tang,False,30/06/1969,M,NaN,M,tommy2@adventure-works.com,USD 30000,One,0,Graduate Degree,Estudios de postgrado,Bac + 3,Clerical,Administrativo,Employé,1,0,"111, rue Maillard",NaN,1 (11) 500 555-0136,4/09/2012,0-1 Miles
18480,29480,248,AW00029480,NaN,Nina Raji,False,6/05/1977,S,NaN,F,nina21@adventure-works.com,USD 30000,Three,0,Graduate Degree,Estudios de postgrado,Bac + 3,Clerical,Administrativo,Employé,1,0,9 Katherine Drive,NaN,1 (11) 500 555-0146,17/07/2013,0-1 Miles
18481,29481,120,AW00029481,NaN,Ivan Suri,False,4/07/1965,S,NaN,M,ivan0@adventure-works.com,USD 30000,Three,0,Graduate Degree,Estudios de postgrado,Bac + 3,Clerical,Administrativo,Employé,0,0,Knaackstr 4,NaN,1 (11) 500 555-0144,13/08/2011,0-1 Miles
18482,29482,179,AW00029482,NaN,Clayton Zhang,False,1/09/1964,M,NaN,M,clayton0@adventure-works.com,USD 30000,Three,0,Bachelors,Licenciatura,Bac + 4,Clerical,Administrativo,Employé,1,0,"1080, quai de Grenelle",NaN,1 (11) 500 555-0137,18/09/2012,0-1 Miles
18483,29483,217,AW00029483,NaN,Jésus Navarro,False,6/06/1965,M,NaN,M,jésus9@adventure-works.com,USD 30000,NaN,0,Bachelors,Licenciatura,Bac + 4,Clerical,Administrativo,Employé,1,0,"244, rue de la Centenaire",NaN,1 (11) 500 555-0141,9/09/2012,0-1 Miles

In [59]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18484 entries, 0 to 18483
Data columns (total 27 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   CustomerKey           18484 non-null  int64
 1   GeographyKey          18484 non-null  int64
 2   CustomerAlternateKey  18484 non-null  object
 3   Title                 101 non-null    object
 4   Name                  18484 non-null  object
 5   NameStyle             18484 non-null  bool
 6   BirthDate             18484 non-null  object
 7   MaritalStatus         18484 non-null  object
 8   Suffix                3 non-null      object
 9   Gender                18484 non-null  object
 10  EmailAddress          18484 non-null  object
 11  YearlyIncome          18484 non-null  object
 12  TotalChildren         13319 non-null  object
 13  NumberChildrenAtHome  18484 non-null  int64
 14  EnglishEducation      18484 non-null  object
 15  SpanishEducation      18484 non-null  object
 16  FrenchEducation       18484 non-null  object
 17  EnglishOccupation     18484 non-null  object
 18  SpanishOccupation     18484 non-null  object
 19  FrenchOccupation      18484 non-null  object
 20  HouseOwnerFlag        18484 non-null  int64
 21  NumberCarsOwned       18484 non-null  int64
 22  AddressLine1          18484 non-null  object
 23  AddressLine2          312 non-null    object
 24  Phone                 18484 non-null  object
 25  DateFirstPurchase     18484 non-null  object
 26  CommuteDistance       18484 non-null  object
dtypes: bool(1), int64(5), object(21)
memory usage: 3.7+ MB

In [60]:
df.columns = df.columns.str.strip()

In [61]:
# Split the cell to convert into float
df[["Currency", "Income"]] = df["YearlyIncome"].str.split(" ", expand = True)

In [62]:
# Dropped unnecessary columns
df = df.drop(["CustomerAlternateKey","NumberCarsOwned","Phone","Title","NameStyle","Suffix","TotalChildren","EnglishEducation","SpanishEducation","FrenchEducation","EnglishOccupation","SpanishOccupation","FrenchOccupation","HouseOwnerFlag",'AddressLine2',"YearlyIncome"],axis=1)

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18484 entries, 0 to 18483
Data columns (total 13 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   CustomerKey           18484 non-null  int64
 1   GeographyKey          18484 non-null  int64
 2   Name                  18484 non-null  object
 3   BirthDate             18484 non-null  object
 4   MaritalStatus         18484 non-null  object
 5   Gender                18484 non-null  object
 6   EmailAddress          18484 non-null  object
 7   NumberChildrenAtHome  18484 non-null  int64
 8   AddressLine1          18484 non-null  object
 9   DateFirstPurchase     18484 non-null  object
 10  CommuteDistance       18484 non-null  object
 11  Currency              18484 non-null  object
 12  Income                18484 non-null  object
dtypes: int64(3), object(10)
memory usage: 1.8+ MB

In [64]:
df['Income'] = df["Income"].astype("int")

In [65]:
# Replaced unnecessary information from column
df["CommuteDistance"] = df["CommuteDistance"].str.replace(" Miles", "")

In [66]:
df.duplicated().sum()

np.int64(0)

In [67]:
df.to_csv(r"D:\Zephyr Data\project\Cleaned Data\Dim_Customer.csv", index= False)

In [68]:
df

,CustomerKey,GeographyKey,Name,BirthDate,MaritalStatus,Gender,EmailAddress,NumberChildrenAtHome,AddressLine1,DateFirstPurchase,CommuteDistance,Currency,Income
0,11000,26,Jon Yang,6/10/1971,M,M,jon24@adventure-works.com,2,3761 N. 14th St,19/01/2011,1-2,USD,90000
1,11001,37,Eugene Huang,10/05/1976,S,M,eugene10@adventure-works.com,3,2243 W St.,15/01/2011,0-1,USD,60000
2,11002,31,Ruben Torres,9/02/1971,M,M,ruben35@adventure-works.com,3,5844 Linden Land,7/01/2011,2-5,USD,60000
3,11003,11,Christy Zhu,14/08/1973,S,F,christy12@adventure-works.com,0,1825 Village Pl.,29/12/2010,5-10,USD,70000
4,11004,19,Elizabeth Johnson,5/08/1979,S,F,elizabeth5@adventure-works.com,5,7553 Harness Circle,23/01/2011,1-2,USD,80000
...,...,...,...,...,...,...,...,...,...,...,...,...,...
18479,29479,209,Tommy Tang,30/06/1969,M,M,tommy2@adventure-works.com,0,"111, rue Maillard",4/09/2012,0-1,USD,30000
18480,29480,248,Nina Raji,6/05/1977,S,F,nina21@adventure-works.com,0,9 Katherine Drive,17/07/2013,0-1,USD,30000
18481,29481,120,Ivan Suri,4/07/1965,S,M,ivan0@adventure-works.com,0,Knaackstr 4,13/08/2011,0-1,USD,30000
18482,29482,179,Clayton Zhang,1/09/1964,M,M,clayton0@adventure-works.com,0,"1080, quai de Grenelle",18/09/2012,0-1,USD,30000
18483,29483,217,Jésus Navarro,6/06/1965,M,M,jésus9@adventure-works.com,0,"244, rue de la Centenaire",9/09/2012,0-1,USD,30000